---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.GetLayerModifiers
source: html/3d752980-c4ea-6a3b-3708-c00ae5c377e5.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.GetLayerModifiers Method

Gets all the project layer modifiers from the layer info.

## Syntax (C#)
```csharp
public IList<LayerModifier> GetLayerModifiers()
```

## Returns
The project layer modifier array.